_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=======================================
input_1 (InputLayer)         [(None, 10, 14)]          0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 10, 14)            0         
_________________________________________________________________
expand_last_dim (ExpandLastD (None, 10, 14, 1)         0         
_________________________________________________________________
normalization (Normalization (None, 10, 14, 1)         3         
_________________________________________________________________
conv2d (Conv2D)              (None, 8, 12, 256)        2560      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 6, 10, 256)        590080    
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 3, 5, 256)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 5, 32)          73760     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 5, 32)          9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 3, 32)          0         
_________________________________________________________________
global_max_pooling2d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 33        
_________________________________________________________________
classification_head_1 (Activ (None, 1)                 0         
======================================
Total params: 675,684
Trainable params: 675,681
Non-trainable params: 3
_________________________________________________________________