_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=======================================
input_1 (InputLayer)         [(None, 10, 14)]          0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 10, 14)            0         
_________________________________________________________________
expand_last_dim (ExpandLastD (None, 10, 14, 1)         0         
_________________________________________________________________
normalization (Normalization (None, 10, 14, 1)         3         
_________________________________________________________________
conv2d (Conv2D)              (None, 8, 12, 32)         320       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 6, 10, 64)         18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 3, 5, 64)          0         
_________________________________________________________________
dropout (Dropout)            (None, 3, 5, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 960)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 960)               0         
_________________________________________________________________
dense (Dense)                (None, 9)                 8649      
_________________________________________________________________
classification_head_1 (Softm (None, 9)                 0         
======================================
Total params: 27,468
Trainable params: 27,465
Non-trainable params: 3
_________________________________________________________________