__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==========================================================
input_1 (InputLayer)            [(None, 10, 14)]     0                                            
__________________________________________________________________________________________________
cast_to_float32 (CastToFloat32) (None, 10, 14)       0           input_1[0][0]                    
__________________________________________________________________________________________________
expand_last_dim (ExpandLastDim) (None, 10, 14, 1)    0           cast_to_float32[0][0]            
__________________________________________________________________________________________________
normalization (Normalization)   (None, 10, 14, 1)    3           expand_last_dim[0][0]            
__________________________________________________________________________________________________
random_translation (RandomTrans (None, 10, 14, 1)    0           normalization[0][0]              
__________________________________________________________________________________________________
random_flip (RandomFlip)        (None, 10, 14, 1)    0           random_translation[0][0]         
__________________________________________________________________________________________________
resizing (Resizing)             (None, 224, 224, 1)  0           random_flip[0][0]                
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 224, 224, 3)  0           resizing[0][0]                   
                                                                 resizing[0][0]                   
                                                                 resizing[0][0]                   
__________________________________________________________________________________________________
efficientnetb7 (Functional)     (None, None, None, 2 64097687    concatenate[0][0]                
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 2560)         0           efficientnetb7[0][0]             
__________________________________________________________________________________________________
dense (Dense)                   (None, 9)            23049       global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
classification_head_1 (Softmax) (None, 9)            0           dense[0][0]                      
==========================================================
Total params: 64,120,739
Trainable params: 63,810,009
Non-trainable params: 310,730
__________________________________________________________________________________________________